{
  "recipes": [
    {
      "name": "Tepache",
      "source": "https://nourishedkitchen.com/tepache/",
      "ingredients": [

      ],
      "method": [

      ]
    },
    {
      "name": "Chana Saag (Chickpea and Spinach Curry)",
      "source": "https://ministryofcurry.com/chana-saag-chickpeas-and-spinach/",
      "ingredients": [
        "1 15 oz can of chickpeas",
        "4 cups fresh baby spinach",
        "1 medium tomato",
        "1 small onion",
        "1/2 tsp turmeric",
        "1 tsp red chili powder",
        "1 tsp grated ginger",
        "2 cloves garlic finely chopped",
        "1 tsp ground cumin",
        "1 tsp garam masala",
        "1/2 tsp mango powder amchoor",
        "1 tbsp ghee"
      ],
      "method": [
        "Peel and finely chop the onion. In a medium sized pot, add ghee and when it’s sizzling hot, toss in the chopped onions. Saute the onions for ten minutes with a pinch of salt.",
        "When the onion starts turning a pale golden, add the ginger and garlic, and saute for another five minutes until the onions turn a darker shade of golden.",
        "Add the turmeric, chilli and cumin powders and stir for a minute. If the mixture starts getting stuck to the bottom of the pot, add a tablespoon of warm water and scrape it off.",
        "Next, chop the tomato roughly and chuck it into the masala, stirring for a couple of minutes until it disintegrates. When it does, add half a cup of warm water. lower the heat to medium and let the spices infuse the tomato.",
        "In about five minutes, when you see oil oozing through the surface of the masala, roughly chop the spinach and stir into the masala. Now, rinse and drain the chickpeas and mix them in.",
        "Let the chickpeas cook with the spices for another five minutes. To finish, add salt to taste, sprinkle garam masala and amchoor powder all over and serve hot."
      ]
    },
    {
      "name": "Guiness Cake"
    },
    {
      "name": "TODO"
    },
    {
      "name": "Banana Bread",
      "source": "https://www.bbc.co.uk/food/recipes/bananabread_85720",
      "ingredients": [
        "285g/10oz plain flour",
        "1 tsp bicarbonate of soda",
        "0.5 tsp salt",
        "110g/4oz butter, plus extra for greasing",
        "225g/8oz caster sugar",
        "2 free-range eggs",
        "4 ripe bananas, mashed",
        "85ml/3fl oz buttermilk (or normal milk mixed with 1.5 tsp lemon juice or vinegar)",
        "1 tsp vanilla extract"
      ],
      "method": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "Sift the flour, bicarbonate of soda and salt into a large mixing bowl.",
        "In a separate bowl, cream the butter and sugar together until light and fluffy.",
        "Add the eggs, mashed bananas, buttermilk and vanilla extract to the butter and sugar mixture and mix well. Fold in the flour mixture.",
        "Grease a 20cm x 12.5cm/8in x 5in loaf tin (2lb) and pour the cake mixture into the tin.",
        "Transfer to the oven and bake for about 45 mins uncovered, then 10 minutes covered with foil, or until well-risen and golden-brown.",
        "Remove from the oven and cool in the tin for a few minutes, then turn out onto a wire rack to cool completely before serving."
      ]
    },
    {
      "name": "Banana Blueberry Pancakes",
      "source": "https://www.tasteofhome.com/recipes/banana-blueberry-pancakes/",
      "ingredients": [
        "1 cup whole wheat flour",
        "1/2 cup all-purpose flour",
        "2 tablespoons sugar",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 large egg, room temperature, lightly beaten"
      ],
      "method": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "Sift the flour, bicarbonate of soda and salt into a large mixing bowl.",
        "In a separate bowl, cream the butter and sugar together until light and fluffy.",
        "Add the eggs, mashed bananas, buttermilk and vanilla extract to the butter and sugar mixture and mix well. Fold in the flour mixture.",
        "Grease a 20cm x 12.5cm/8in x 5in loaf tin (2lb) and pour the cake mixture into the tin.",
        "Transfer to the oven and bake for about 45 mins uncovered, then 10 minutes covered with foil, or until well-risen and golden-brown.",
        "Remove from the oven and cool in the tin for a few minutes, then turn out onto a wire rack to cool completely before serving."
      ]
    },
    {
      "name": "Banana Blueberry Pancakes",
      "source": "https://www.tasteofhome.com/recipes/banana-blueberry-pancakes/",
      "ingredients": [
        "1 cup whole wheat flour",
        "1/2 cup all-purpose flour",
        "2 tablespoons sugar",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 large egg, room temperature, lightly beaten"
      ],
      "method": [
        "In a large bowl, combine the flours, sugar, baking powder and salt. Combine the egg, milk, bananas and vanilla; stir into dry ingredients just until moistened.",
        "Pour batter by 1/4 cupfuls onto a hot griddle coated with cooking spray; sprinkle with blueberries. Turn when bubbles form on top; cook until second side is golden brown. If desired, serve with syrup and sliced bananas.",
        "Freeze option: Freeze cooled pancakes between layers of waxed paper in a resealable freezer container. To use, place pancakes on an ungreased baking sheet, cover with foil, and reheat in a preheated 375° oven 6-10 minutes. Or, place a stack of 3 pancakes on a microwave-safe plate and microwave on high for 1-1/4 to 1-1/2 minutes or until heated through."
      ]
    },
    {
      "name": "Egg Free Double Chocolate Banana Muffins",
      "source": "https://www.tasteofhome.com/recipes/egg-free-double-chocolate-banana-muffins/",
      "ingredients": [
        "1-1/2 cups all-purpose flour",
        "2/3 cup sugar",
        "1/2 cup baking cocoa",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1-1/3 cups mashed ripe bananas (about 2 to 3 medium)"
      ],
      "method": [
        "Preheat oven to 350°. In a large bowl, whisk the first 5 ingredients. In another bowl, whisk the bananas, yogurt, oil and vanilla until blended. Add to flour mixture; stir just until moistened. Fold in chocolate chips.",
        "Fill 12 greased or foil-lined muffin cups three-fourths full. Bake until a toothpick inserted in center comes out clean, 15-20 minutes. Cool 5 minutes before removing from pan to a wire rack. If desired, dust with baking cocoa. Serve warm."
      ]
    },
    {
      "name": "Banana Chocolat Cake",
      "source": "https://www.tasteofhome.com/recipes/banana-chocolate-cake/",
      "ingredients": [
        "1/3 cup butter, softened",
        "Sugar substitute equivalent to 3/4 cup sugar",
        "1/3 cup packed brown sugar",
        "2 teaspoons vanilla extract",
        "2 large eggs, room temperature",
        "1/2 cup water",
        "1-1/3 cups all-purpose flour",
        "1/2 cup nonfat dry milk powder",
        "3 tablespoons baking cocoa",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup mashed ripe bananas (about 2 medium bananas)",
        "Confectioners' sugar"
      ],
      "method": [
        "Preheat oven to 375°. Coat a 9-in. square baking pan with cooking spray.",
        "Cream butter, sugar substitute and brown sugar until light and fluffy. Add vanilla and eggs, one at a time, beating well after each addition. Stir in water. Whisk together flour, milk powder, cocoa, baking powder, baking soda and salt; add to creamed mixture just until combined. Stir in bananas.",
        "Transfer to prepared pan. Bake until a toothpick inserted in center comes out clean and cake begins to pull from sides of pan, 23-28 minutes. Cool completely in pan on a wire rack. Dust with confectioners' sugar."
      ]
    },
    {
      "name": "Carrot Cake Skillet Cake",
      "source": "https://www.chocolatemoosey.com/2016/03/21/carrot-cake-skillet-cake/",
      "ingredients": [
        "2/3 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon salt",
        "1/3 cup granulated sugar",
        "2 tablespoons packed brown sugar",
        "1/4 cup vegetable oil",
        "1/4 cup whole milk, room temperature",
        "1 egg, room temperature",
        "1/2 teaspoon vanilla extract",
        "1 large carrot, peeled and grated",
        "1/4 cup canned crushed pineapple, liquid drained",
        "1/4 cup coconut flakes",
        "1/4 cup chopped walnuts",
        "1/4 cup raisins",
        "GLAZE:",
        "1/2 cup powdered sugar",
        "1 tablespoon milk",
        "1/4 teaspoon vanilla extract"
      ],
      "method": [
        "Preheat oven to 350F. Have an 8-inch cast iron pan or an 8-inch round cake pan ready.",
        "In a large bowl, mix together the flour, baking soda, cinnamon, nutmeg, and salt.",
        "In a large mixing bowl, beat together on medium speed the sugar, brown sugar, oil, milk, egg, and vanilla until smooth. Gradually beat in the flour mixture on low speed then add in the carrots, pineapple, coconut, walnuts, and raisins (do not overbeat the batter or you may end up with a tough cake).",
        "Transfer the batter to the cast iron pan or cake pan and bake 28-30 minutes or until a toothpick inserted in the center comes out clean.",
        "For the glaze: In a medium bowl, whisk together the powdered sugar, milk, and vanilla. Spread over the still-warm cake. Let glaze harden before serving. Serve cake warm or at room temperature."
      ]
    },
    {
      "name": "Shoofly Chocolate Pie",
      "source": "https://www.tasteofhome.com/recipes/shoofly-chocolate-pie/",
      "ingredients": [
        "Pastry for single-crust pie (9 inches)",
        "1/2 cup semisweet chocolate chips",
        "1-1/2 cups all-purpose flour",
        "1/2 cup packed brown sugar",
        "3 tablespoons butter-flavored shortening",
        "1 teaspoon baking soda",
        "1-1/2 cups water",
        "1 large egg, room temperature, lightly beaten",
        "1 cup molasses"
      ],
      "method": [
        "Roll out dough to fit a 9-in. deep-dish pie plate or cast-iron skillet. Trim to 1/2 in. beyond rim of plate; flute edges. Sprinkle chocolate chips into crust; set aside.",
        "In a large bowl, combine flour and brown sugar; cut in shortening until crumbly. Set aside 1 cup for topping. Add the baking soda, water, egg and molasses to remaining crumb mixture and mix well. Pour over chips. Sprinkle with reserved crumb mixture.",
        "Bake at 350° until a knife inserted in the center comes out clean, 45-55 minutes. Let stand on a wire rack for 15 minutes before cutting. Serve warm."
      ]
    },
    {
      "name": "Giant Buckeye Cookie (Skillet)",
      "source": "https://www.tasteofhome.com/recipes/giant-buckeye-cookie/",
      "ingredients": [
        "1 package chocolate cake mix (regular size)",
        "2 large eggs, room temperature",
        "1/2 cup canola oil",
        "1 cup semisweet chocolate chips",
        "1 cup creamy peanut butter",
        "1/2 cup confectioners' sugar",
        "Optional: Hot fudge ice cream topping, vanilla ice cream, whipped cream and melted creamy peanut butter"
      ],
      "method": [
        "Preheat oven to 350°. In a large bowl, combine cake mix, eggs and oil until blended. Stir in chocolate chips. Press half the dough into a 10-in. cast-iron or other ovenproof skillet. Combine peanut butter and confectioners' sugar; spread over dough in skillet. Press remaining dough between sheets of parchment into a 10-in. circle; place over filling.",
        "Bake until a toothpick inserted in center comes out with moist crumbs, 20-25 minutes. Serve warm, with optional ingredients as desired."
      ]
    },
    {
      "name": "Fudge Brownie Pie",
      "source": "https://www.tasteofhome.com/recipes/fudge-brownie-pie/",
      "ingredients": [
        "1 cup sugar",
        "1/2 cup butter, melted",
        "2 large eggs, room temperature",
        "1 teaspoon vanilla extract",
        "1/2 cup all-purpose flour",
        "1/3 cup baking cocoa",
        "1/4 teaspoon salt",
        "1/2 cup chopped pecans",
        "Whipped cream, optional",
        "Strawberries, optional"
      ],
      "method": [
        "In a large bowl, beat sugar and butter. Add eggs and vanilla; mix well. Add flour, cocoa and salt. Stir in nuts.",
        "Pour into a greased 9-in. pie pan or ovenproof skillet. Bake at 350° until almost set, 25-30 minutes. Serve with whipped cream and strawberries if desired."
      ]
    },
    {
      "name": "Skillet Stout Brownies",
      "source": "https://www.tasteofhome.com/recipes/skillet-stout-brownies/",
      "ingredients": [
        "8 ounces semisweet chocolate, chopped",
        "1 cup butter, cubed",
        "1 cup milk stout beer",
        "1 large egg, room temperature",
        "2 large egg yolks, room temperature",
        "3/4 cup sugar",
        "1/4 cup packed brown sugar",
        "3/4 cup all-purpose flour",
        "1/3 cup baking cocoa",
        "1/2 teaspoon salt",
        "Vanilla ice cream, optional"
      ],
      "method": [
        "Preheat oven to 350°. Place chocolate in a large bowl. In a 10-in. cast-iron or other ovenproof skillet, combine butter and stout. Bring to a boil; reduce heat. Simmer 10 minutes, stirring constantly. Pour over chocolate; stir with a whisk until smooth. Cool slightly. In another large bowl, beat egg, egg yolks and sugars until blended. Stir in chocolate mixture. In another bowl, mix flour, baking cocoa and salt; gradually add to chocolate mixture, mixing well.",
        "Spread into skillet. Bake until set, 25-30 minutes. Cool completely in skillet on a wire rack. If desired, serve with vanilla ice cream."
      ]
    },
    {
      "name": "Tepache",
      "source": "https://nourishedkitchen.com/tepache/",
      "ingredients": [
        "3/4 cup packed brown sugar",
        "1/4 cup baking cocoa",
        "1 tablespoon cornstarch",
        "Dash salt",
        "2 cups water",
        "2 tablespoons butter",
        "DUMPLINGS:",
        "1-1/4 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 cup sugar",
        "2 tablespoons baking cocoa",
        "3 tablespoons butter",
        "1 large egg, lightly beaten",
        "1/3 cup 2% milk",
        "1 teaspoon vanilla extract",
        "Whipped cream or ice cream"
      ],
      "method": [
        "For sauce, combine brown sugar, cocoa, cornstarch and salt in a large, heavy cast-iron or other ovenproof skillet. Stir in water; cook, stirring constantly, until mixture begins to boil and thicken slightly. Add butter; mix well. Remove sauce from heat.",
        "For dumplings, sift together flour, baking powder, salt, sugar and cocoa. Cut in butter until mixture resembles a fine meal. Combine the egg, milk and vanilla; blend gradually into flour mixture.",
        "Return skillet to heat; bring the chocolate sauce to a boil. Drop dumplings by tablespoons into hot sauce. Reduce heat to low; cover and simmer until just set, about 20 minutes. Serve warm with whipped cream or ice cream."
      ]
    },
    {
      "name": "Chocolate Dutch Baby",
      "source": "https://www.bonappetit.com/recipe/chocolate-dutch-baby",
      "ingredients": [
        "3 large eggs",
        "⅓ cup all-purpose flour",
        "¼ cup sugar",
        "3 tablespoons unsweetened cocoa powder",
        "¾ teaspoon kosher salt",
        "½ cup whole milk",
        "1 ounce bittersweet, semisweet, or milk chocolate",
        "¼ cup heavy cream",
        "1 tablespoon unsalted butter",
        "Coffee ice cream (for serving)"
      ],
      "method": [
        "Arrange a rack in center of oven; preheat to 425°. Place a dry medium skillet on rack to preheat.",
        "Whisk 3 eggs, ⅓ cup flour, ¼ cup sugar, 3 Tbsp. cocoa powder, and ¾ tsp. salt in a medium bowl until smooth.",
        "Whisking constantly, slowly stream ½ cup milk into egg mixture. Cover with plastic and let batter rest 15 minutes.",
        "Meanwhile, chop 1 oz. chocolate and transfer to a small saucepan. Add ¼ cup cream and cook over low heat, whisking often, until chocolate is melted and mixture is completely smooth; season with a pinch of salt. Keep warm over low heat.",
        "Remove skillet from oven and add 1 Tbsp. butter; swirl skillet to melt, making sure to coat entire bottom and sides of skillet.",
        "Give batter a quick whisk to reincorporate, then pour into skillet. Quickly transfer to oven, taking care because the handle is hot.",
        "Cook until pancake is dramatically puffed and edges are curling inward toward center but center is still moist, 10–12 minutes. Remove skillet from oven (watch for that handle again) and let rest about 2 minutes. The pancake will immediately begin to fall, but that’s normal. Meanwhile, pull ice cream out of freezer to let it soften slightly.",
        "Top with 2 scoops ice cream and drizzle with warm chocolate sauce; serve warm."
      ]
    },
    {
      "name": "Savoury Dutch Baby",
      "source": "https://www.bonappetit.com/recipe/savory-dutch-baby",
      "ingredients": [
        "3 large eggs, room temperature",
        "¾ cup whole milk, room temperature",
        "3 tablespoons unsalted butter, melted, slightly cooled, divided",
        "½ cup all-purpose flour",
        "2 tablespoons cornstarch",
        "½ teaspoon kosher salt",
        "½ teaspoon freshly ground black pepper"
      ],
      "method": [
        "Place a medium ovenproof skillet, preferably cast iron, in center of oven and preheat oven to 450°. Let skillet heat at least 25 minutes total (prepare your toppings while you wait).",
        "Blend eggs in a blender on high speed until very frothy, about 1 minute. With motor running, gradually stream in milk, then 2 Tbsp. butter; blend another 30 seconds. Add flour, cornstarch, salt, and pepper and blend just to combine. (This batter doubles well if you want to scale up.)",
        "Carefully remove skillet from oven and swirl remaining 1 Tbsp. butter in skillet to coat. Immediately pour batter into skillet (butter will brown quickly, so have batter at the ready to prevent burning). Bake pancake until puffed and brown around edges, 20–25 minutes. It will begin to deflate as soon as it comes out. Top as desired."
      ]
    },
    {
      "name": "Tepache",
      "source": "https://nourishedkitchen.com/tepache/",
      "ingredients": [
        "CAKE:",
        "4 medium beets, scrubbed",
        "2 Tbsp. virgin coconut oil, plus more for pan",
        "½ cup Dutch-process cocoa powder, plus more for pan",
        "1½ cups almond flour",
        "½ tsp. baking soda",
        "½ tsp. ground cinnamon",
        "2 oz. bittersweet chocolate, coarsely chopped",
        "1 tsp. apple cider vinegar or distilled white vinegar",
        "1 tsp. vanilla extract",
        "4 large eggs",
        "1¼ cups (packed) light brown sugar",
        "1 tsp. kosher salt",
        "GLAZE:",
        "4 oz. bittersweet chocolate, coarsely chopped",
        "1 Tbsp. virgin coconut oil",
        "¼ tsp. vanilla extract",
        "Pinch of kosher salt",
        "Gold luster dust (for serving; optional)"
      ],
      "method": [
        "Cook beets in a medium pot of boiling unsalted water until tender, 30–40 minutes, depending on size. Drain and rinse under cold water until cool enough to handle. Cut off stem end, then peel and cut beets into large pieces. Transfer to a blender and add 2 Tbsp. water. Blend, adding water 1 Tbsp. at a time as needed, until a smooth purée forms—it should be the consistency of applesauce. Measure out 1 cup purée (reserve remaining purée for another use, such as blending into a smoothie).",
        "Preheat oven to 350°. Line bottom of an 8in round cake pan with parchment. Grease with oil, then dust with cocoa powder, tapping out excess.",
        "Whisk almond flour, baking soda, cinnamon, and remaining ½ cup cocoa powder in a medium bowl; set aside.",
        "Heat chocolate and remaining 2 Tbsp. oil in a medium heatproof bowl set over a saucepan of barely simmering water, stirring often, until melted. Remove bowl from heat. Stir in vinegar, vanilla, and reserved 1 cup beet purée until smooth.",
        "Beat eggs, brown sugar, and salt in the large bowl of a stand mixer fitted with the whisk attachment on medium-high speed (or use an electric mixer and large bowl) until more than tripled in volume and mixture holds a ribbon for several seconds when beater is lifted above batter, 5–7 minutes. Thoroughly beating the eggs is key to creating an aerated, light crumb and is a critical step when using gluten-free ingredients.",
        "Pour chocolate-beet mixture into egg mixture and beat on medium-low speed until combined. Turn mixer off and gently tip in reserved dry ingredients. Beat on lowest speed, scraping down bowl as needed, until combined.",
        "Transfer batter to prepared pan. Bake cake until a tester inserted into the center comes out clean and the top springs back when gently pressed, 45–50 minutes. Let cool 10 minutes. Carefully run a knife around edges of pan, then invert cake onto a wire rack and let cool.",
        "GLAZE:",
        "Heat chocolate, oil, vanilla, and salt in a medium heatproof bowl set over a saucepan of barely simmering water, stirring often, until chocolate is melted. Let cool, stirring occasionally, until mixture is thickened and cool enough to touch, 10–15 minutes.",
        "Place rack with cake on a rimmed baking sheet. Pour glaze over center of cake to cover top, tilting baking sheet slightly to encourage a few drips to run over sides of cake. Sprinkle with luster dust (if using). Let sit at room temperature until glaze is set, 2–3 hours.",
        
      ]
    }
  ]
}